duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
   PROJECT_FAILSAFE_MODE                                 = 0x08000000,
   PROJECT_FAILSAFE_MASK                                 = 0x0F000000,
   PROJECT_FAILSAFE_UNMASK                               = 0xF0FFFFFF,

   PROJECT_FAIL_STATUS                                   = 0x80000000,
};

#define SET_PROJECT_INIT_STATUS(x)                       (x = ((x & PROJECT_STATUS_UNMASK) | PROJECT_INIT_STATUS))
#define IS_PROJECT_INIT_STATUS(x)                        (x & PROJECT_INIT_STATUS)

#define SET_PROJECT_READY_STATUS(x)                      (x = ((x & PROJECT_STATUS_UNMASK) | PROJECT_READY_STATUS))
#define IS_PROJECT_READY_STATUS(x)                       (x & PROJECT_READY_STATUS)

#define SET_PROJECT_NORMAL_STATUS(x)                     (x = ((x & PROJECT_STATUS_UNMASK) | PROJECT_NORMAL_STATUS))
#define IS_PROJECT_NORMAL_STATUS(x)                      (x & PROJECT_NORMAL_STATUS)

#define SET_PROJECT_FAILSAFE_MODE(x)                     (x = ((x & PROJECT_FAILSAFE_UNMASK) | PROJECT_FAILSAFE_MODE))
#define RESET_PROJECT_FAILSAFE_MODE(x)                   (x = (x & PROJECT_FAILSAFE_UNMASK))
#define IS_PROJECT_FAILSAFE_MODE(x)                      (x & PROJECT_FAILSAFE_MODE)

#define SET_PROJECT_FAIL_STATUS(x)                       (x = (x | PROJECT_FAIL_STATUS))
#define IS_PROJECT_FAIL_STATUS(x)                        (x & PROJECT_FAIL_STATUS)

// -----------------------------------------------------------------------------
enum RESPONSE_ERROR_CODE
{
   SUCCESS_RESPONSE                                      = 0,
   ERROR_RESPONSE_VERSION                                = 1,
   ERROR_RESPONSE_CRC_ERROR                              = 2,
   ERROR_RESPONSE_CHANNEL_FAILED                         = 3,
   ERROR_ALREADY_REGISTERED                              = 4,
   ERROR_UNKNOWN_COMMAND                                 = 5,
   ERROR_INTERNAL_PACKET_SIZE                            = 6,
   ERROR_PACKET_SIZE                                     = 7,
};

// -----------------------------------------------------------------------------
// for timer
#define MAX_TIMER_COUNT                                  10
typedef void (*TIMER_FN)(void*);
typedef struct _TIMER
{
   uint32_t tick_count;

   uint32_t ms_elapse;
   int call_count;
   int call_fn_count;

   TIMER_FN fn_timer;

   void* pData;
} TIMER;


// -----------------------------------------------------------------------------
// for project
typedef struct _PROJECT
{
   // remote controller status
   uint32_t mode;
   // timer tick count
   uint32_t tick_count;

   // check alive
   uint32_t last_alive_tick_count;

   uint32_t client_alive_count;
   uint8_t register_client;

   // tick counter when enter failsafe mode
   uint32_t enter_failsafe_mode_tick_count;

   // use internal : packet for fc
   uint8_t internal_tx_buffer[SERIAL_RX_TRANSMITTER_MAX_SIZE];
   uint8_t internal_tx_packet_size;

   // send to fc
   uint8_t fc_tx_buffer[SERIAL_RX_TRANSMITTER_MAX_SIZE];
   uint8_t fc_tx_packet_size;

   // for receive data from bt
   uint8_t bt_rx_buffer[PROTOCOL_CHANNEL_MAX_SIZE];
   uint8_t received_rx_length;
   uint32_t received_drop_frame_cout;

   // for response to bt
   uint8_t bt_tx_buffer[PROTOCOL_BASIC_MAX_SIZE];
   uint8_t parsing_status;
   uint16_t parsing_result_code;

   TIMER timer[MAX_TIMER_COUNT];

} PROJECT;

#define RTC_HZ_FOR_TICK_COUNT                            32768
#define MILLI_SECOND                                     1000

#define MILLI_SECOND_TO_TICK_COUNT(ms)                   ((RTC_HZ_FOR_TICK_COUNT * ms) / MILLI_SECOND)
#define SECOND_TO_TICK_COUNT(s)                          (RTC_HZ_FOR_TICK_COUNT * s)
#define TICK_COUNT_TO_MILLI_SECOND(count)                ((count * MILLI_SECOND) / RTC_HZ_FOR_TICK_COUNT)
#define TICK_COUNT_TO_SECOND(count)                      (count * MILLI_SECOND / RTC_HZ_FOR_TICK_COUNT)

// -----------------------------------------------------------------------------
static PROJECT gProject[1]                               =
{
   {
      .mode                                              = PROJECT_INIT_STATUS,
   },
};


// -----------------------------------------------------------------------------
// for failsafe mode
#define FAILSAFE_MODE_TIME_OUT_SECOND                    30
typedef struct
{
   uint16_t channel_id;
   uint16_t value;
} FAILSAFE_MODE_VALUE;

// -----------------------------------------------------------------------------
// ...
#define IS_SRVC_CHANGED_CHARACT_PRESENT                  0                       /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#define CENTRAL_LINK_COUNT                               0                       /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT                            1                       /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define NUS_SERVICE_UUID_TYPE                            BLE_UUID_TYPE_VENDOR_BEGIN /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                                 64                      /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS                       180                     /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER                              0                       /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE                          4                       /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL                                MSEC_TO_UNITS(20, UNIT_1_25_MS)  /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL                                MSEC_TO_UNITS(75, UNIT_1_25_MS)  /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                                    0                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                                 MSEC_TO_UNITS(4000, UNIT_10_MS)  /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY                   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY                    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT                     3                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define START_STRING                                     "Start...\r\n"

