duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
#define DEAD_BEEF                                        0xDEADBEEF              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                                 256                     /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                                 256                     /**< UART RX buffer size. */

static ble_nus_t                                         m_nus;                  /**< Structure to identify the Nordic UART Service. */
static uint16_t m_conn_handle                            = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[]                          = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};    /**< Universally unique service identifier. */
// -----------------------------------------------------------------------------


/******************************************************************
 *
 * Function Name : add_timer
 *
 *
 ******************************************************************/
static int add_timer(TIMER_FN fn, uint32_t ms_elapse, int count, void* pdata)
{
   int i;
   if (fn == NULL || ms_elapse == 0)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] function is null(%p) or ms_slapse is 0 (%d) \r\n", __FUNCTION__, __LINE__, fn, ms_elapse);
#endif
      return -1;
   }
   for (i = 0; i < MAX_TIMER_COUNT; i++)
   {
      if (gProject->timer[i].fn_timer == NULL)
      {
         gProject->timer[i].tick_count                   = 0;
         gProject->timer[i].ms_elapse                    = ms_elapse;
         gProject->timer[i].call_count                   = count;
         gProject->timer[i].fn_timer                     = fn;
         gProject->timer[i].pData                        = pdata;
      }
   }
#if defined(DEBUG_RTT_ERROR)
   NRF_LOG_PRINTF("[%s-%d] timer is full (total timer = %d) \r\n", __FUNCTION__, __LINE__, MAX_TIMER_COUNT);
#endif
   return -1;
}

/******************************************************************
 *
 * Function Name : delete_timer
 *
 *
 ******************************************************************/
static int delete_timer(TIMER_FN fn)
{
   int i;
   if (fn == NULL)
   { 
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] function is null \r\n", __FUNCTION__, __LINE__);
#endif
      return -1;
   }
   for (i = 0; i < MAX_TIMER_COUNT; i++)
   {
      if (gProject->timer[i].fn_timer == fn)
      {
         gProject->timer[i].tick_count                   = 0;
         gProject->timer[i].ms_elapse                    = 0;
         gProject->timer[i].call_count                   = 0;
         gProject->timer[i].call_fn_count                = 0;
         gProject->timer[i].fn_timer                     = 0;
         gProject->timer[i].pData                        = NULL;
      }
   }
#if defined(DEBUG_RTT_ERROR)
   NRF_LOG_PRINTF("[%s-%d] Not found timer (%p) \r\n", __FUNCTION__, __LINE__, fn);
#endif
   return -1;
}


/******************************************************************
 *
 * Function Name : serial_receiver_timer_handler()
 *
 *
 ******************************************************************/
static void serial_receiver_timer_handler(void * p_context)
{
   uint32_t tick_count                                   = 0;
   uint32_t diff_tick_count                              = 0;
   int i;

   app_timer_cnt_get(&tick_count);

   for (i = 0; i < MAX_TIMER_COUNT; i++)
   {
      if (gProject->timer[i].tick_count == 0)
      {
         gProject->timer[i].tick_count                   = tick_count;
      }
      else
      {
         diff_tick_count                                 = 0;
         app_timer_cnt_diff_compute(tick_count, gProject->timer[i].tick_count, &diff_tick_count);

         if (diff_tick_count > MILLI_SECOND_TO_TICK_COUNT(gProject->timer[i].ms_elapse))
         {
            gProject->timer[i].tick_count                = tick_count;
            if (gProject->timer[i].call_count < 0)
            {
               (*gProject->timer[i].fn_timer)(gProject->timer[i].pData);
            }
            else if (gProject->timer[i].call_fn_count < gProject->timer[i].call_count)
            {
               (*gProject->timer[i].fn_timer)(gProject->timer[i].pData);
            }
         }
      }
   }
}


// -----------------------------------------------------------------------------
// for protocol of transmitter
#if defined(SERIAL_RECEIVER)

// -----------------------------------------------------------------------------
// protocol type
#define SERIAL_RX_SPEKTRUM_1024
// #define SERIAL_RX_SPEKTRUM_2048
// #define SERIAL_RX_S_BUS
// #define SERIAL_RX_SUMD
// #define SERIAL_RX_SUMH
// #define SERIAL_RX_MODE_B
// #define SERIAL_RX_MODE_B_BJ01
// #define SERIAL_RX_IBUS
// #define SERIAL_RX_MSP


// -----------------------------------------------------------------------------
#if defined(SERIAL_RX_SPEKTRUM_1024)

// -----------------------------------------------------------------------------
// for timer function
// spektrum 1024 : 22 ms
#define SERIAL_RX_SEND_TO_FC_TIMER                       22
// 60 ms
#define SERIAL_RX_COMMAND_PARSING_TIMER                  60
// 60 ms
#define SERIAL_RX_COMMAND_RESPONSE_TIMER                 60
// 500 ms
#define SERIAL_RX_COMMAND_FAILSAFE_TIMER                 100

// -----------------------------------------------------------------------------
// UART
// BAUDRATE : 125000 bps, or 1152000 bps
// DATA     : 8 bits
// PARITY   : NO Parity
// stop bit : 1 stop

// -----------------------------------------------------------------------------
#define SERIAL_RX_BAUDRATE                               (UART_BAUDRATE_BAUDRATE_Baud115200)
#define DEVICE_NAME                                      "DRONE-BT-CONTROLLER"                     /**< Name of device. Will be included in the advertising data. */

