duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
// -----------------------------------------------------------------------------
#elif defined(SERIAL_RX_MSP)

// -----------------------------------------------------------------------------
#else
#error "Not supported"
#endif      // SERIAL_RX_SPEKTRUM_1024
#endif      // SERIAL_RECEIVER

/******************************************************************
 *
 * Function Name : timer_send_msg_to_fc_controller()
 *
 *
 ******************************************************************/
#define UART_RETRY_SEND_COUNT                            1
static void timer_send_msg_to_fc_controller(void* pdata)
{
   int i;
   int retry_count                                       = 0;
#if defined(DEBUG_OUTPUT_FC_CHANNEL_DATA)
// To output string per about 2 seconds
static int msg_output_count                              = 0;

   if (((++msg_output_count) % 90) == 0)
   {
      NRF_LOG_PRINTF("send packet to the FC \r\n");
   }
#endif

   if (gProject->internal_tx_packet_size > 0)
   {
      memcpy(gProject->fc_tx_buffer, gProject->internal_tx_buffer, gProject->internal_tx_packet_size);
      gProject->fc_tx_packet_size                        = gProject->internal_tx_packet_size;
      gProject->internal_tx_packet_size                  = 0;
   }
   for (i = 0; i < (gProject->fc_tx_packet_size); i++)
   {
      retry_count                                        = 0;
      while(app_uart_put(gProject->fc_tx_buffer[i]) != NRF_SUCCESS)
      {
         if (UART_RETRY_SEND_COUNT < retry_count++)
         {
#if defined(DEBUG_RTT_ERROR)
            NRF_LOG_PRINTF("[%s-%d] failed send to the UART [%d] [0x%02X] \r\n", __FUNCTION__, __LINE__, i, gProject->fc_tx_buffer[i]);
#endif
            return;
         }
#if defined(DEBUG_OUTPUT_FC_CHANNEL_DATA)
         if (((msg_output_count) % 90) == 0)
         {
            NRF_LOG_PRINTF("[");
            NRF_LOG_HEX(gProject->fc_tx_buffer[i]);
            NRF_LOG_PRINTF("] ");
         }
#endif
      }
   }
#if defined(DEBUG_OUTPUT_FC_CHANNEL_DATA)
   if (((msg_output_count) % 90) == 0)
   {
      NRF_LOG_PRINTF("\r\n");
   }
#endif

}

/******************************************************************
 *
 * Function Name : timer_bt_command_parser()
 *
 *
 ******************************************************************/
static void timer_bt_command_parser(void* pdata)
{
   BT_PROTOCOL_COMMAND* pbtProtocolCommand               = NULL;
   BT_PROTOCOL_COMMAND* pbtProtocolResponse              = NULL;
   BT_PROTOCOL_DATA* pbtProtocolChannelData              = NULL;
   uint8_t rx_data_length                                = gProject->received_rx_length;

   if (gProject->parsing_status != 0)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] Does not process previous command !!! \r\n", __FUNCTION__, __LINE__);
#endif
      return;
   }

   if (gProject->received_rx_length > 0)
   {
      pbtProtocolCommand                                 = (BT_PROTOCOL_COMMAND*) gProject->bt_rx_buffer;
      pbtProtocolResponse                                = (BT_PROTOCOL_COMMAND*) gProject->bt_tx_buffer;

      gProject->parsing_result_code                      = SUCCESS_RESPONSE;
      gProject->parsing_status                           = 1;
      gProject->received_rx_length                       = 0;

      pbtProtocolResponse->version_high                  = PROTOCOL_HEADER_HIGH_VERSION;
      pbtProtocolResponse->version_low                   = PROTOCOL_REGISTER_RESPONSE;

      pbtProtocolResponse->size                          = PROTOCOL_BASIC_MAX_SIZE;

      // error code
      pbtProtocolResponse->option_1_high                 = 0;
      pbtProtocolResponse->option_1_low                  = SUCCESS_RESPONSE;

      // reserved
      pbtProtocolResponse->option_2_high                 = 0;
      pbtProtocolResponse->option_2_low                  = 0;


      switch (pbtProtocolCommand->command)
      {
         case PROTOCOL_REGISTER_MESSAGE :
            pbtProtocolResponse->command                 = PROTOCOL_REGISTER_RESPONSE;

            // check internal packet size
            if (rx_data_length != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_INTERNAL_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_INTERNAL_PACKET_SIZE;
#if defined(DEBUG_RTT_ERROR)
               NRF_LOG_PRINTF("[%s-%d] Wrong size or mismathed size from size of receive from bt(register cmd) \r\n", __FUNCTION__, __LINE__);
#endif
               return;
            }

            // check packet size
            if (pbtProtocolCommand->size != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_PACKET_SIZE;
#if defined(DEBUG_RTT_ERROR)
               NRF_LOG_PRINTF("[%s-%d] Wrong packet size (register cmd) \r\n", __FUNCTION__, __LINE__);
#endif
               return;
            }
            break;

         case PROTOCOL_ALIVE_MESSAGE :
            pbtProtocolResponse->command                 = PROTOCOL_ALIVE_RESPONSE;

            // check internal packet size
            if (rx_data_length != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_INTERNAL_PACKET_SIZE;

               // error code
               pbtProtocolResponse->option_1_high        = 0;
               pbtProtocolResponse->option_1_low         = ERROR_INTERNAL_PACKET_SIZE;
#if defined(DEBUG_RTT_ERROR)
               NRF_LOG_PRINTF("[%s-%d] Wrong size or mismathed size from size of receive from bt(register cmd) \r\n", __FUNCTION__, __LINE__);
#endif
               return;
            }

            // check packet size
            if (pbtProtocolCommand->size != PROTOCOL_BASIC_MAX_SIZE)
            {
               gProject->parsing_result_code             = ERROR_PACKET_SIZE;

